# Books(Core) Project

**Brittany Lassiter**

## Books ERD

 ![png](Data/bookcore.png)

## Imports/Data

In [23]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [24]:
import json
with open ("C:/Users/blass/.secret/mysql.json") as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [25]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/Books"
engine = create_engine(connection)

In [26]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

## Show Tables

In [27]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Empty tables

In [29]:
q= '''SELECT * FROM authors'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [author_id, author_name]
Index: []

In [30]:
q= '''SELECT * FROM books'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [book_id, Title, authors_author_id]
Index: []

In [31]:
q= '''SELECT * FROM favorites'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [book_id, user_id]
Index: []

In [28]:
q= '''SELECT * FROM users'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [user_id, first_name, last_name, email]
Index: []

## Import Data

In [33]:
df = pd.read_csv('Data/Customers_favorite_books - Customers_favorite_books.csv')
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   First Name   7 non-null      object
 1   Last Name    7 non-null      object
 2   Email        7 non-null      object
 3   Book Title   7 non-null      object
 4   Book Author  7 non-null      object
dtypes: object(5)
memory usage: 408.0+ bytes

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

## Testing Database

In [44]:
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON book.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));

SyntaxError: invalid syntax (2031215808.py, line 1)